# ========================5====================
# Модуль pathlib має функцію read_text(), що читає текстовий файл 
# path.read_text().count("\n") читає текстовий файл і обчислює кількість рядків шляхом підрахунку рядків.
# len(path.read_text().split()) читає текстовий файл і обчислює кількість слів
# len(path.read_text()) читає текстовий файл і обчислює кількість символів, знаходячи довжину рядка.

# Написати скрипт, що може читати один або декілька текстових файлів і повідомляти, скільки рядків, слів і символів містить кожен із файлів. 

# Написати скрипт, що може читати один або декілька текстових файлів і повідомляти, скільки рядків, слів і символів містить кожен із файлів. щоб уникнути повторних виклиуів, використовуйте оператор Walrus


import pathlib
import sys

for filename in sys.argv[1:]:
    path = pathlib.Path(filename)
    counts = [
        (text := path.read_text()).count("\n"),  # Number of lines
        len(text.split()),  # Number of words
        len(text),  # Number of characters
    ]
    print(*counts, path)

# $ python wc.py wc.py