# Є список словників [{ 'n': 4 }, { 'n': 2 }, { 'n': 8 }, { 'n': 6 }]
# Напишіть функцію, що обчислює середнє значення списку після зіставлення кожного елемента зі значенням за допомогою наданої функції lambda x: x['n'].

# - Використовуйте `map()`, щоб зіставити кожен елемент зі значенням, яке повертає `fn`.
# - Використовуйте `sum()`, щоб підсумувати всі зіставлені значення, розділити на `len(lst)`.
# - Пропустіть останній аргумент, `fn`, щоб використовувати функцію ідентифікації за замовчуванням.


def average_by(lst, fn = lambda x: x):
  return sum(map(fn, lst), 0.0) / len(lst)

average_by([{ 'n': 4 }, { 'n': 2 }, { 'n': 8 }, { 'n': 6 }], lambda x: x['n'])
# 5.0